import numpy as np
class MammalCheck:
    def __init__(self):
        x_data = np.array(
            [[0,0],
             [1,0],
             [1,1],
             [0,0],
             [0,0],
             [0,1],]
        )

        """
        원핫 인코딩... [20%, 20%, 50%] 인 경우 [0,0,1] 로 인코딩... 
        
            [털,날개] -> [기타,포유류,조류]
             [0,0] -> 기타[1,0,0],
             [1,0] -> 포유류[0,1,0],
             [1,1] -> 조류[0,0,1],
             [0,0] -> 기타,
             [0,0] -> 기타,
             [0,1] -> 조류[0,0,1]
        """